### Задание

Написать программу (инсталлятор), которая будет привязывать запуск вашей основной программы к вашему компьютеру.

### Пример работы

1. Вы запускаете инсталятор. Он создает исполняемый файл program.
2. На своем компьютере вы запускаете program -> она запускается и работает.
3. Вы переносите файл program на другой компьютер и запускаете -> она не запускается.

По итогу созданные program файл может запускаться только на той машине, на который был запущен инсталятор.

### Как это работает?

1. Имеется программа, которую нужно обезопасить. Для начала выделяется главная функция (в моем случае она называется start) вызвав которую запустится весь функционал (в моем случае простой калькулятор). Создается динамическая библиотека (в моем случае libgeneral.so), которая предоставляет доступ к данной функции.
2. Далее инсталятор создает файл со следующей структурой кода:

```c
#include <stdio.h> 									
#include <string.h> 								

extern int start();					

int main() 											
{													
 char unique_id[32];
 FILE *f; 
 if ((f = fopen("/var/lib/dbus/machine-id", "r")) == NULL)
 {													
 printf("Don't work on your machine!");			
 return -1;												
 }													
 fscanf(f, "%s", unique_id);						
 fclose(f);											
 if (!strcmp(unique_id, YOUR_MACHINE_ID)) 						
  start();										
 else												
  printf("Access is denied");						
}	
```
installer вшивает в запуск программы ваш YOUR_MACHINE_ID и сравнивает его с machine-id машины на которой запускается основная программа (если используете machine-id хотя бы чуть-чуть нужно почитать https://man7.org/linux/man-pages/man5/machine-id.5.html).

3. Далее данный файл компилируется (и удаляется исходный сгенерированный си файл.

Таким образом installer создает программу, которая сравнивает machine-id машины на которой запускается программа с machine-id компьютера, на котором был запущен инсталятор. И если они не совпадают (значит это другая машина) то доступ отклонен и не вызывается главная функция start из динамической библиотеки.
